In [11]:
import pandas as pd
import matplotlib.pyplot as plt
from sqlalchemy import create_engine

## Read cleaned up version of our CSV files

### Read Athletes

In [12]:
athletes_path = "../Output/athletes.csv"
athletes = pd.read_csv(athletes_path)
athletes = athletes.drop(columns=['Unnamed: 0'])
athletes

      last_name   first_name        noc           discipline
0          Abad       Nestor      Spain  Artistic Gymnastics
1      Abagnale     Giovanni      Italy               Rowing
2        Abalde      Alberto      Spain           Basketball
3        Abalde       Tamara      Spain           Basketball
4         Abalo          Luc     France             Handball
...         ...          ...        ...                  ...
6354  Riedemann        Laura    Germany             Swimming
6355     Rieder       Celine    Germany             Swimming
6356   Riendeau      Vincent     Canada               Diving
6357      Riera  Zuzuarregui      Spain               Hockey
6358     Rigney         Tara  Australia               Rowing

[6359 rows x 4 columns]

### Read Coaches

In [13]:
coaches_path = "../Output/coaches.csv"
coaches = pd.read_csv(coaches_path)
coaches = coaches.drop(columns=['Unnamed: 0'])
coaches

    last_name first_name                         noc         discipline  event
0      Aikman  Siegfried                       Japan             Hockey    Men
1          Al      Saadi                     Germany             Hockey    Men
2       Annan     Alyson                 Netherlands             Hockey  Women
3       Arnau      Creus                       Japan             Hockey  Women
4       Basso      Paola               Great Britain  Artistic Swimming   Duet
..        ...        ...                         ...                ...    ...
98       Wang        Jie  People's Republic of China  Artistic Swimming   Team
99       Wang       Yang  People's Republic of China             Hockey  Women
100  Zaitseva     Olesia                     Ukraine  Artistic Swimming   Duet
101     Zhang   Xiaohuan  People's Republic of China  Artistic Swimming    NaN
102      Zijp      Simon                 Netherlands             Hockey    NaN

[103 rows x 5 columns]

### Read Medals

In [14]:
medals_path = "../Output/medals.csv"
medals = pd.read_csv(medals_path)
medals

                           noc  gold  total  rank  rank_by_total
0     United States of America    39    113     1              1
1   People's Republic of China    38     88     2              2
2                        Japan    27     58     3              5
3                Great Britain    22     65     4              4
4                          ROC    20     71     5              3
5                    Australia    17     46     6              6
6                  Netherlands    10     36     7              9
7                       France    10     33     8             10
8                      Germany    10     37     9              8
9                        Italy    10     40    10              7
10                      Canada     7     24    11             11
11                      Brazil     7     21    12             12
12                 New Zealand     7     20    13             13
13                        Cuba     7     15    14             18
14                     Hungary     6     20    15             13
15           Republic of Korea     6     20    16             13
16                      Poland     4     14    17             19
17                       Spain     3     17    22             17
18                 Switzerland     3     13    24             20
19                      Turkey     2     13    35             20
20                     Ukraine     1     19    44             16

### Read Teams

In [15]:
teams_path = "../Output/teams.csv"
teams = pd.read_csv(teams_path)
teams = teams.drop(columns=['Unnamed: 0'])
teams

              name  discipline                         noc       event
0        Australia     Archery                   Australia  Men's Team
1        Australia     Archery                   Australia  Mixed Team
2           Brazil     Archery                      Brazil  Mixed Team
3           Canada     Archery                      Canada  Mixed Team
4            China     Archery  People's Republic of China  Men's Team
..             ...         ...                         ...         ...
408            ROC  Water Polo                         ROC       Women
409          Spain  Water Polo                       Spain         Men
410          Spain  Water Polo                       Spain       Women
411  United States  Water Polo    United States of America         Men
412  United States  Water Polo    United States of America       Women

[413 rows x 4 columns]

### Connect to Local Database

In [16]:
rds_connection_string = "postgres:postgres@localhost:5432/Tokyo_Olympic"
engine = create_engine(f'postgresql://{rds_connection_string}')

### Load Athletes Table

In [17]:
athletes.to_sql(name='athlete', con=engine, if_exists='append', index=False)

### Load Coaches Table

In [18]:
coaches.to_sql(name='coaches', con=engine, if_exists='append', index=False)

### Load Medals Table

In [19]:
medals.to_sql(name='medals', con=engine, if_exists='append', index=False)

### Load Teams Table

In [20]:
teams.to_sql(name='teams', con=engine, if_exists='append', index=False)